results of the mathematics operations
> (((my_math) 'add) 1 2)
3
> (((my_math) 'subtract) 1 2)
-1
> (((my_math) 'exponent) 1 2)
1
> (((my_math) 'prime_check) 1)
#f (here is wrong result)
> (((my_math) 'divide) 1 2)
1/2
> (((my_math) 'factorials) 12)
479001600
(here is wrong result)
> (((my_math) 'sinus) 2)
3.626860407847019
